{
  "basics": {
    "name": "Jim Park",
    "label": "Operations Engineer",
    "picture": "",
    "email": "jpark@jim80.net",
    "phone": "+1.210.649.5546",
    "summary": "Jim has a passion for creating flow, creativity, and fun in all domains of life. In technology, this manifests as being a champion of automation and manifesting workflows as code. In people, this manifests as listening with kindness, and gentle encouragement towards individual accomplishment. Resume feedback is welcome and appreciated! Please submit feedback to https://github.com/jim80net/jim-resume/issues",
    "location": {
      "address": "529 Natoma St",
      "postalCode": "94103",
      "city": "San Francisco",
      "countryCode": "United States",
      "region": "California"
    }
  },
  "work": [
    {
      "company": "Credit Suisse Labs",
      "position": "Member of the Technical Staff",
      "website": "https://credit-suisse.com",
      "startDate": "September 2017",
      "endDate": "Present",
      "summary": "Responsible for setting up Credit Suisse Labs software operations to enable maximal experimentation and flexibility.",
      "highlights": [
        "Created CI/CD system leveraging GCP services like Google Cloud Builder, Google Container Repository, Helm, and Keel",
        "Authentication using Google Cloud Identity and Identity Proxy"
      ]
    },
    {
      "company": "Pivotal Software",
      "position": "Cloud Operations Product Manager / Team Anchor",
      "website": "https://pivotal.io",
      "startDate": "December 2014",
      "endDate": "September 2017",
      "summary": "Technical leader in Cloud Foundry Cloud Operations team. Developed self-updating deployment pattern for PCF, and got pretty close for OSS Cloud Foundry as well.",
      "highlights": [
        "Technical liason for Rackspace Managed Pivotal Cloud Foundry",
        "Published reference monitoring guidelines and templates for Cloud Foundry",
        "Container-based CI systems"
      ]
    },
    {
      "company": "Wildbit, LLC",
      "position": "Systems Engineer",
      "website": "https://wildbit.com",
      "startDate": "March 2014",
      "endDate": "October 2014",
      "summary": "Developed Chef automation to reduce configuration drift for linux and OmniOS production servers."
    },
    {
      "company": "Adknowledge, Inc.",
      "position": "Senior Linux Administrator",
      "website": "http://adknowledge.com/",
      "startDate": "August 2012",
      "endDate": "March 2014",
      "summary": "Developed Puppet automation to reduce configuration drift on all development and production servers."
    },
    {
      "company": "IC Solutions",
      "position": "Senior Systems Administrator",
      "website": "https://www.icsolutions.com/",
      "startDate": "July 2011",
      "endDate": "August 2012",
      "summary": "Developed Puppet automation to reduce configuration drift on production servers in data center and in customer sites."
    },
    {
      "company": "Peer 1 Hosting",
      "position": "IT Administrator",
      "website": "https://www.cogecopeer1.com/",
      "startDate": "August 2008",
      "endDate": "July 2011",
      "summary": "I encountered a daily barrage of break-fix scenarios, from failed hard drives, to misconfigured apache servers, to troubleshooting performance problems. I become intimately familiar with networking, performance engineering, linux and Windows OS configuration under a variety of architectural patterns."
    },
    {
      "company": "Mt San Antonio College",
      "position": "Student Assistant V",
      "website": "https://www.mtsac.edu/",
      "startDate": "December 2007",
      "endDate": "August 2008",
      "summary": "Created infrastructure for automated OS and MSI package deployment for lab workstations, enabling Systems Administrators to avoid around with OS/software disks, and reducing lab setup time from days to hours."
    },
    {
      "company": "United States Marine Corps",
      "position": "Sergeant - Ground Electronics Telecommunications and Information Technology Systems Maintainer",
      "website": "https://usmc.mil",
      "startDate": "June 2001",
      "endDate": "December 2007",
      "summary": "Reduced MTTR from 6 months to same day or next day for roughly 75% of telecom and IT system equipment repair orders in support of US and allied forces in OIF II.  Was awarded certificate of commendation for achievement."
    }
  ],
  "volunteer": [
    {
      "organization": "Social Mobility Pathways",
      "position": "Chairman and President",
      "startDate": "November 2018",
      "endDate": "Present",
      "summary": "Social Mobility Pathways matches mentors with junior professionals and students. Mentors receive leadership training, and mentees are given guidance and structures for fulfilling on their life's purpose."
    },
    {
      "organization": "Toastmasters International",
      "position": "Area Director",
      "startDate": "September 2016",
      "endDate": "Present",
      "summary": "Toastmasters International is a nonprofit educational organization that operates clubs for the purpose of promoting communication, public speaking, and leadership skills."
    }
  ]
}
