{
  "name": "Jim Park",
  "info": {
    "label": "Operations Engineer",
    "image": "",
    "brief": "Jim has a passion for creating flow, creativity, and fun in all domains of life. In technology, this manifests as being a champion of automation and manifesting workflows as code. In people, this manifests as listening with kindness, and gentle encouragement towards individual accomplishment."
  },
  "contact": {
    "email": "jpark@jim80.net",
    "phone": "+1.210.649.5546"
  },
  "meta": {
    "format": "FRESH@^1.0.0-beta",
    "modified": "2018-12-27T17:24:07.407Z"
  },
  "location": {
    "city": "San Francisco",
    "region": "California",
    "country": "United States",
    "code": "94103",
    "address": "529 Natoma St"
  },
  "employment": {
    "history": [
      {
        "position": "Member of the Technical Staff",
        "employer": "Credit Suisse Labs",
        "summary": "Credit Suisse Labs leverages new tools and new ways of working to build new businesses or refresh old ones in a way that benefits both Credit Suisse as well as society as a whole. I have the pleasure of working with world-class  scientists and engineers leveraging bleeding edge technology. ",
        "start": "September 2017",
        "end": "Present",
        "url": "https://credit-suisse.com",
        "keywords": [],
        "highlights": [
          "Created CI/CD system leveraging GCP services like Google Cloud Builder, Google Container Repository, Helm, and Keel",
          "Created using BeyondCorp practices to secure Labs operating infrastructure."
        ]
      },
      {
        "position": "Cloud Operations Product Manager / Team Anchor",
        "employer": "Pivotal Software",
        "summary": "I was responsible for Cloud Operations in such roles as Team Anchor and Product Manager I loved operating at the bleeding edge of Cloud Native platforms, and I particularly loved the dynamic of Pair Operating. The team had a breadth of skills and backgrounds, and being able to spend much time with everyone was immensely satisfying. Every day was an adventure in learning and teaching.",
        "start": "December 2014",
        "end": "September 2017",
        "url": "https://pivotal.io",
        "keywords": [],
        "highlights": [
          "Technical liason for Rackspace Managed Pivotal Cloud Foundry",
          "Created fully-automated (from product release to production) deployment pattern, reducing operator toil",
          "Published reference monitoring guidelines and templates for Cloud Foundry"
        ]
      },
      {
        "position": "Systems Engineer",
        "employer": "Wildbit, LLC",
        "summary": "Developed Chef automation to reduce configuration drift for linux and OmniOS production servers.",
        "start": "March 2014",
        "end": "October 2014",
        "url": "https://wildbit.com",
        "keywords": []
      },
      {
        "position": "Senior Linux Administrator",
        "employer": "Adknowledge, Inc.",
        "summary": "Developed Puppet automation to reduce configuration drift on all development and production servers.",
        "start": "August 2012",
        "end": "March 2014",
        "url": "http://adknowledge.com/",
        "keywords": []
      },
      {
        "position": "Senior Systems Administrator",
        "employer": "IC Solutions",
        "summary": "Developed Puppet automation to reduce configuration drift on production servers in data center and in customer sites.",
        "start": "July 2011",
        "end": "August 2012",
        "url": "https://www.icsolutions.com/",
        "keywords": []
      },
      {
        "position": "IT Administrator",
        "employer": "Peer 1 Hosting",
        "summary": "I encountered a daily barrage of break-fix scenarios, from failed hard drives, to misconfigured apache servers, to troubleshooting performance problems. I become intimately familiar with networking, performance engineering, linux and Windows OS configuration under a variety of architectural patterns.",
        "start": "August 2008",
        "end": "July 2011",
        "url": "https://www.cogecopeer1.com/",
        "keywords": []
      },
      {
        "position": "Student Assistant V",
        "employer": "Mt San Antonio College",
        "summary": "Created infrastructure for automated OS and MSI package deployment for lab workstations, enabling Systems Administrators to avoid around with OS/software disks, and reducing lab setup time from days to hours.",
        "start": "December 2007",
        "end": "August 2008",
        "url": "https://www.mtsac.edu/",
        "keywords": []
      },
      {
        "position": "Sergeant - Ground Electronics Telecommunications and Information Technology Systems Maintainer",
        "employer": "United States Marine Corps",
        "summary": "Reduced MTTR from 6 months to same day or next day for roughly 75% of telecom and IT system equipment repair orders in support of US and allied forces in OIF II.  Was awarded certificate of commendation for achievement.",
        "start": "June 2001",
        "end": "December 2007",
        "url": "https://usmc.mil",
        "keywords": []
      }
    ]
  },
  "service": {
    "history": [
      {
        "type": "volunteer",
        "position": "Chairman and President",
        "organization": "Social Mobility Pathways",
        "start": "November 2018",
        "end": "Present",
        "summary": "Social Mobility Pathways matches mentors with junior professionals and students. Mentors receive leadership training, and mentees are given guidance and structures for fulfilling on their life's purpose."
      },
      {
        "type": "volunteer",
        "position": "Area Director",
        "organization": "Toastmasters International",
        "start": "September 2016",
        "end": "Present",
        "summary": "Toastmasters International is a nonprofit educational organization that operates clubs for the purpose of promoting communication, public speaking, and leadership skills."
      }
    ]
  }
}