{
  "name": "Jim Park",
  "info": {
    "label": "Operations Engineer",
    "image": "",
    "brief": "Jim has a passion for creating flow, creativity, and fun in all domains of life. In technology, this manifests as being a champion of automation and manifesting workflows as code. In people, this manifests as listening with kindness, and gentle encouragement towards individual accomplishment."
  },
  "contact": {
    "email": "jpark@jim80.net",
    "phone": "+1.210.649.5546"
  },
  "meta": {
    "format": "FRESH@^1.0.0-beta",
    "modified": "2018-12-20T02:52:39.047Z"
  },
  "location": {
    "city": "San Francisco",
    "region": "California",
    "country": "United States",
    "code": "94103",
    "address": "529 Natoma St"
  },
  "employment": {
    "history": [
      {
        "position": "Member of the Technical Staff",
        "employer": "Credit Suisse Labs",
        "summary": "Credit Suisse Labs leverages new tools and new ways of working to build new businesses or refresh old ones in a way that benefits both Credit Suisse as well as society as a whole. I have the pleasure of working with world-class  scientists and engineers leveraging bleeding edge technology. ",
        "start": "September 2017",
        "end": "Present",
        "url": "https://credit-suisse.com",
        "keywords": [],
        "highlights": [
          "Created CI/CD system leveraging GCP services like Google Cloud Builder, Google Container Repository, Helm, and Keel",
          "Created using BeyondCorp practices to secure Labs operating infrastructure."
        ]
      },
      {
        "position": "Cloud Operations Product Manager / Team Anchor",
        "employer": "Pivotal Software",
        "summary": "I was responsible for Cloud Operations in roles as Product Manager and Team Anchor. I loved operating at the bleeding edge of Cloud Native platforms, and I particularly loved the dynamic of Pair Operating. The team had a breadth of skills and backgrounds, and being able to spend much time with everyone was immensely satisfying. Every day was an adventure in learning and teaching. ",
        "start": "December 2014",
        "end": "September 2017",
        "url": "https://pivotal.io",
        "keywords": [],
        "highlights": [
          "Technical liason for Rackspace Managed Pivotal Cloud Foundry",
          "Created fully-automated (from product release to production) deployment pattern, reducing operator toil",
          "Took ownership of reference monitoring guidelines and templates for Cloud Foundry, improving visibility and MTTR"
        ]
      },
      {
        "position": "Systems Engineer",
        "employer": "Wildbit, LLC",
        "summary": "Working with Wildbit was an interesting experience, and the company culture is great. But this was where I learned that working from home was too isolating for me. I learned that I enjoy bringing other people along on journeys with me, and sought that out in my next career move.",
        "start": "March 2014",
        "end": "October 2014",
        "url": "https://wildbit.com",
        "keywords": [],
        "highlights": [
          "Implemented chef-based configuration management for linux and OmniOS servers"
        ]
      },
      {
        "position": "Senior Linux Administrator",
        "employer": "Adknowledge, Inc.",
        "summary": "The best part, and the hardest part, about working with Adknowledge was the performance requirements of the product required hardware assets. This was where I most developed the skill to design tools that were resilient to I/O failure and could manage thousands of nodes.",
        "start": "August 2012",
        "end": "March 2014",
        "url": "http://adknowledge.com/",
        "keywords": [],
        "highlights": [
          "Created using puppet-based configuration management to reduce configuration errors and change deployment time",
          "Created custom infrastructure SSH tool (like a hacky ansible) to manage configuration drift"
        ]
      },
      {
        "position": "Senior Systems Administrator",
        "employer": "IC Solutions",
        "summary": "ICSolutions was where I developed my passion for configuration management tooling. Given a broad array of customer sites, I wrote tooling to configure linux servers and Juniper networking equipment. ",
        "start": "July 2011",
        "end": "August 2012",
        "url": "https://www.icsolutions.com/",
        "keywords": [],
        "highlights": [
          "Created using puppet-based configuration management to reduce configuration errors and change deployment time",
          "Configuration of JunOS/ScreenOS network devices"
        ]
      },
      {
        "position": "IT Administrator",
        "employer": "Peer 1 Hosting",
        "summary": "Given the business-critical nature of the servers we hosted, I encountered a daily barrage of priority break-fix scenarios, from failed hard drives, to misconfigured apache servers, to troubleshooting performance problems. Working in hosting pushed me enabled me to become intimately familiar with networking, DNS, web hosting, and the many ways systems can break.",
        "start": "August 2008",
        "end": "July 2011",
        "url": "https://www.cogecopeer1.com/",
        "keywords": [],
        "highlights": [
          "Implemented LANDesk ITSM suite to automatically provision software and configuration management of workstations"
        ]
      },
      {
        "position": "Student Assistant V",
        "employer": "Mt San Antonio College",
        "summary": "While attending computer networking courses, I was a student assistant and configured lab workstations. This was where I learned about virtual machines on my shiny XPS laptop. I setup the laptop with PXE and Symantec Ghost so that I could avoid walking around with OS disks.  ",
        "start": "December 2007",
        "end": "August 2008",
        "url": "https://www.mtsac.edu/",
        "keywords": [],
        "highlights": [
          "Created using gold images and PXE to reduce desktop deployment times by eliminating the need to walk around with OS disks.",
          "Created MSI packages to deploy using GPO, rather than install on site"
        ]
      },
      {
        "position": "Sergeant - Ground Electronics Telecommunications and Information Technology Systems Maintainer",
        "employer": "United States Marine Corps",
        "summary": "I served for over 5 years in support of our nation's interests. This was a transformative experience in being a part of a highly structured and effective organization.",
        "start": "June 2001",
        "end": "December 2007",
        "url": "https://usmc.mil",
        "keywords": [],
        "highlights": [
          "Created bench stock of repair parts and customized repair procedures during support operations in OIF. These actions enabled an order of reduction in Mean Time To Repair from 6 months to same day or next day for the most common repairs. Was awarded certificate of commendation for achievement."
        ]
      }
    ]
  },
  "service": {
    "history": [
      {
        "type": "volunteer",
        "position": "President",
        "organization": "Social Mobility Pathways",
        "start": "November 2018",
        "end": "Present",
        "summary": "Social Mobility Pathways matches mentors with junior professionals and students. Mentors receive leadership training, and mentees are connected with caring and compassionate guidance."
      },
      {
        "type": "volunteer",
        "position": "Area Director",
        "organization": "Toastmasters International",
        "start": "September 2016",
        "end": "Present",
        "summary": "Toastmasters International is a nonprofit educational organization that operates clubs for the purpose of promoting communication, public speaking, and leadership skills."
      }
    ]
  },
  "social": [
    {
      "label": "Twitter",
      "network": "Twitter",
      "url": "",
      "user": "jim80net"
    }
  ]
}